borodark/OS-II/erts/example/mini_beam_esp32/zephyr_app/src/main.c
typedef struct {
    const char *name;
    uint8_t bus;
    uint8_t addr;
    uint8_t reg;
    uint8_t expected;
    uint8_t mask;
} os2_sensor_sig_t;

typedef struct {
    const char *name;
    uint8_t id;
    uint8_t bus;
    uint8_t addr;
    uint8_t reg;
} os2_sensor_target_t;

typedef struct {
    uint32_t attempted;
    uint32_t pushed;
    uint32_t dropped_full;
    uint32_t processed;
} os2_mb_stats_t;

typedef struct {
    uint8_t id;
    uint8_t degraded;
    uint32_t read_count;
    uint32_t consecutive_errors;
    uint32_t backoff_until_ms;
    uint32_t degraded_since_ms;
} os2_sensor_runtime_t;

static const os2_sensor_sig_t os2_sensor_sigs[] = {
    {"MPU60x0/92x0", 0, 0x68, 0x75, 0x68, 0x7E},
    {"LSM9DS1_AG", 1, 0x6A, 0x0F, 0x68, 0xFF},
    {"LSM9DS1_MAG", 1, 0x1C, 0x0F, 0x3D, 0xFF},
    {"LSM6DS3/LSM6DSL", 1, 0x6A, 0x0F, 0x69, 0xFF},
    {"LSM6DSOX", 1, 0x6A, 0x0F, 0x6C, 0xFF},
    {"BMI270", 1, 0x68, 0x00, 0x24, 0xFF},
    {"BMM150", 1, 0x10, 0x40, 0x32, 0xFF},
    {"APDS9960", 1, 0x39, 0x92, 0xAB, 0xFF},
    {"HTS221", 1, 0x5F, 0x0F, 0xBC, 0xFF},
    {"LPS22HB", 1, 0x5C, 0x0F, 0xB1, 0xFF},
    {"BME280", 0, 0x76, 0xD0, 0x60, 0xFF},
    {"BME280", 0, 0x77, 0xD0, 0x60, 0xFF},
    {"BME280", 1, 0x76, 0xD0, 0x60, 0xFF},
    {"BME280", 1, 0x77, 0xD0, 0x60, 0xFF},
};

static uint8_t demo_program[128];
#define OS2_BOOT_MAGIC_GPR2 0xA5U

static uint16_t os2_boot_counter_next(void) {
    uint8_t magic = (uint8_t)(NRF_POWER->GPREGRET2 & 0xFFU);
    uint8_t counter = (uint8_t)(NRF_POWER->GPREGRET & 0xFFU);

    if (magic != OS2_BOOT_MAGIC_GPR2) {
        NRF_POWER->GPREGRET2 = OS2_BOOT_MAGIC_GPR2;
        counter = 0U;
    }

    counter = (uint8_t)(counter + 1U);
    if (counter == 0U) {
        counter = 1U;
    }
    NRF_POWER->GPREGRET = counter;
    return counter;
}

static void os2_emit_u8(size_t *pc, uint8_t value) {
    demo_program[(*pc)++] = value;
}

static void os2_emit_i32(size_t *pc, int32_t value) {
    demo_program[(*pc)++] = (uint8_t)(value & 0xff);
    demo_program[(*pc)++] = (uint8_t)((value >> 8) & 0xff);
    demo_program[(*pc)++] = (uint8_t)((value >> 16) & 0xff);
    demo_program[(*pc)++] = (uint8_t)((value >> 24) & 0xff);
}

static void os2_patch_rel_i32(size_t patch_pos, size_t target_pc) {
    int32_t rel = (int32_t)target_pc - (int32_t)(patch_pos + 4U);
    demo_program[patch_pos + 0] = (uint8_t)(rel & 0xff);
    demo_program[patch_pos + 1] = (uint8_t)((rel >> 8) & 0xff);
    demo_program[patch_pos + 2] = (uint8_t)((rel >> 16) & 0xff);
    demo_program[patch_pos + 3] = (uint8_t)((rel >> 24) & 0xff);
}

static size_t os2_build_cyclic_program(void) {
    size_t pc = 0;
    size_t loop_pc;
    size_t jz_to_sleep_patch;
    size_t jz_to_pwm_patch;
    size_t jmp_over_pwm_patch;
    size_t jmp_to_loop_patch;
    size_t pwm_path_pc;

    /* r6 = idle sleep ms, r10 = published cmd type */
    os2_emit_u8(&pc, MB_OP_CONST_I32);
    os2_emit_u8(&pc, 6);
    os2_emit_i32(&pc, 20);

    os2_emit_u8(&pc, MB_OP_CONST_I32);
    os2_emit_u8(&pc, 10);
    os2_emit_i32(&pc, MB_CMD_NONE);

    os2_emit_u8(&pc, MB_OP_CONST_I32);
    os2_emit_u8(&pc, OS2_REG_CMD_PWM_SET_DUTY);
    os2_emit_i32(&pc, MB_CMD_PWM_SET_DUTY);

    loop_pc = pc;
    /* recv -> r0:type r1:bus r2:addr r3:reg r4:sensor_id */
    os2_emit_u8(&pc, MB_OP_RECV_CMD);
    os2_emit_u8(&pc, 0);
    os2_emit_u8(&pc, 1);
    os2_emit_u8(&pc, 2);
    os2_emit_u8(&pc, 3);
    os2_emit_u8(&pc, 4);

    /* if r0 == 0 then sleep path */
    os2_emit_u8(&pc, MB_OP_JMP_IF_ZERO);
    os2_emit_u8(&pc, 0);
    jz_to_sleep_patch = pc;
    os2_emit_i32(&pc, 0);

    /* if r0 == MB_CMD_PWM_SET_DUTY jump to pwm path */
    os2_emit_u8(&pc, MB_OP_SUB);
    os2_emit_u8(&pc, OS2_REG_TMP);
    os2_emit_u8(&pc, OS2_REG_CMD_TYPE);
    os2_emit_u8(&pc, OS2_REG_CMD_PWM_SET_DUTY);

    os2_emit_u8(&pc, MB_OP_JMP_IF_ZERO);
    os2_emit_u8(&pc, OS2_REG_TMP);
    jz_to_pwm_patch = pc;
    os2_emit_i32(&pc, 0);

    /* value/err in r7 */
    os2_emit_u8(&pc, MB_OP_CALL_BIF);
    os2_emit_u8(&pc, MB_BIF_I2C_READ_REG);
    os2_emit_u8(&pc, 3);
    os2_emit_u8(&pc, 1);
    os2_emit_u8(&pc, 2);
    os2_emit_u8(&pc, 3);
    os2_emit_u8(&pc, 7);

    /* timestamp in r8 */
    os2_emit_u8(&pc, MB_OP_CALL_BIF);
    os2_emit_u8(&pc, MB_BIF_MONOTONIC_MS);
    os2_emit_u8(&pc, 0);
    os2_emit_u8(&pc, 8);

    /* copy context to event registers */
    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, OS2_REG_EVT_BUS);
    os2_emit_u8(&pc, OS2_REG_BUS);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, OS2_REG_EVT_ADDR);
    os2_emit_u8(&pc, OS2_REG_ADDR);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, OS2_REG_EVT_REG);
    os2_emit_u8(&pc, OS2_REG_REG);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, 9);
    os2_emit_u8(&pc, 4);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, 10);
    os2_emit_u8(&pc, 0);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_JMP);
    jmp_over_pwm_patch = pc;
    os2_emit_i32(&pc, 0);

    pwm_path_pc = pc;
    /* PWM path:
     * r1=channel r2=permille r4=actuator_id, return code in r7
     */
    os2_emit_u8(&pc, MB_OP_CALL_BIF);
    os2_emit_u8(&pc, MB_BIF_PWM_SET_DUTY);
    os2_emit_u8(&pc, 2);
    os2_emit_u8(&pc, OS2_REG_BUS);
    os2_emit_u8(&pc, OS2_REG_ADDR);
    os2_emit_u8(&pc, OS2_REG_VALUE);

    os2_emit_u8(&pc, MB_OP_CALL_BIF);
    os2_emit_u8(&pc, MB_BIF_MONOTONIC_MS);
    os2_emit_u8(&pc, 0);
    os2_emit_u8(&pc, OS2_REG_TS);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, OS2_REG_EVT_BUS);
    os2_emit_u8(&pc, OS2_REG_BUS);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, OS2_REG_EVT_ADDR);
    os2_emit_u8(&pc, OS2_REG_ADDR);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_CONST_I32);
    os2_emit_u8(&pc, OS2_REG_EVT_REG);
    os2_emit_i32(&pc, 0);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, OS2_REG_SENSOR_ID);
    os2_emit_u8(&pc, OS2_REG_REG);
    os2_emit_u8(&pc, 0);

    os2_emit_u8(&pc, MB_OP_MOVE);
    os2_emit_u8(&pc, OS2_REG_EVENT_MARK);
    os2_emit_u8(&pc, OS2_REG_CMD_TYPE);
    os2_emit_u8(&pc, 0);

    /* jump back to loop */
    os2_emit_u8(&pc, MB_OP_JMP);
    jmp_to_loop_patch = pc;
    os2_emit_i32(&pc, 0);

    /* sleep path */
    os2_patch_rel_i32(jz_to_sleep_patch, pc);
    os2_emit_u8(&pc, MB_OP_SLEEP_MS);
    os2_emit_u8(&pc, 6);
    os2_emit_u8(&pc, MB_OP_JMP);
    os2_emit_i32(&pc, (int32_t)loop_pc - (int32_t)(pc + 4U));

    os2_patch_rel_i32(jz_to_pwm_patch, pwm_path_pc);
    os2_patch_rel_i32(jmp_over_pwm_patch, pc);
    os2_patch_rel_i32(jmp_to_loop_patch, loop_pc);
    return pc;
}

static void os2_try_enable_i2c_pullups(void) {
    /* Match Arduino core init: detach SWO trace mux from the pull-up control pin. */
    NRF_CLOCK->TRACECONFIG = 0;

#if OS2_HAS_VDD_ENV_EN
    if (device_is_ready(os2_vdd_env_en.port) &&
        gpio_pin_configure_dt(&os2_vdd_env_en, GPIO_OUTPUT_ACTIVE) == 0) {
        LOG_INF("vdd_env enabled on pin %u", os2_vdd_env_en.pin);
    } else {
        LOG_WRN("failed to enable vdd_env");
    }
#endif

#if OS2_HAS_I2C_PULLUP
    if (!device_is_ready(os2_i2c_pullup.port)) {
        LOG_WRN("i2c pull-up gpio not ready");
        return;
    }
    if (gpio_pin_configure_dt(&os2_i2c_pullup, GPIO_OUTPUT_ACTIVE) != 0) {
        LOG_WRN("failed to enable i2c pull-up gpio");
        return;
    }
    LOG_INF("i2c pull-up enabled on pin %u", os2_i2c_pullup.pin);
#endif

